/*************************************************************************
	> File Name: 2.3.cpp
	> Author: 
	> Mail: 
	> Created Time: 2019年07月31日 星期三 15时47分01秒
 ************************************************************************/
//我最欣赏这种解法：空间复杂度为Ｏ(1)!!只需要两个变量！！！！！!
//因为你只需要判断当前斐波那契数列的值，并不需要开数组存储他！！！！！！
#include<iostream>
#define max_n 4000000
using namespace std;

int main() {
    int a = 1, b = 2;
    int sum = 2;
    while (a + b < max_n) {
        b = a + b;
        a = b - a;
        if (!(b & 1)) sum += b;
    }
    printf("%d\n", sum);
    return 0;
}
